# VSCode Extensions
# Extensions for Visual Studio Code.
vscode "4ops.terraform"
vscode "a7ul.vscode-bigtable"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.project-manager"
vscode "alexdima.vscode-lcov"
vscode "arcanis.vscode-zipfs"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "atlassian.atlascode"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "brody715.vscode-cuelang"
vscode "clarkyu.vscode-sql-beautify"
vscode "codesandbox-io.codesandbox-projects"
vscode "continue.continue"
vscode "dandric.vscode-jq"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "gregoire.import-lcov"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "nickgo.cuelang"
vscode "openai.openai-chatgpt-adhoc"
vscode "redhat.vscode-yaml"
vscode "robole.markdown-shortcuts"
vscode "robole.markdown-snippets"
vscode "rszyma.vscode-kanata"
vscode "ryanluker.vscode-coverage-gutters"
vscode "saoudrizwan.claude-dev"
vscode "sebbia.jsonnetng"
vscode "slevesque.vscode-zipexplorer"
vscode "stiansivertsen.visualclojure"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "technosophos.vscode-helm"
vscode "tim-koehler.helm-intellisense"
vscode "tsandall.opa"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "whtouche.vscode-js-console-utils"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
